Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Additionally, you may open survey data files (*.th) in the `Text editor' window and map data files (*.th2) in the `Map editor' window of XTherion.
ru_ru: Кроме того, вы можете открыть файлы данных съемки (*.th) в окне `therion текстовый редактор' и файлы абрисов карт (*.th2) в окне `therion редактор карт'.

source: After a first run there are activated additional menus { Survey structure} and { Map structure}.
ru_ru: После первого запуска активируются дополнительные меню { Структура\break съемки} и { Структура карты}.

source: After caves in your data have been properly defined, you can generate table using
ru_ru: После того, как пещеры в ваших данных были правильно определены, вы можете создать таблицу, используя

source: After creating a new file in the map editor, you may load one or more { images}---scanned survey sketches from the caveXTherion can't scale nor rotate individual images, so use the same orientation, scale and DPI for all images used in the same scrap.]---as a background for the drawing.
ru_ru: После создания нового файла в редакторе карт вы можете загрузить одно или несколько { изображений} (сканированные эскизы съемки пещерыXTherion не может масштабировать и поворачивать отдельные изображения, поэтому используйте ту же ориентацию, масштаб и DPI для всех изображений, используемых в одном и том же скрапе.]) в качестве подложки для рисования.

source: After explaining the basic principles of Therion it's a good idea to try it on the example data.
ru_ru: После объяснения основных принципов работы Therion'а давайте попробуем его на примерах реальных данных.

source: After filling X1,Y1 and X2,Y2 coordinate pairs the calibration arrow will be moved correspondingly.
ru_ru: После заполнения пар координат X1, Y1 и X2, Y2 стрелка калибровки будет перемещаться соответственно.

source: After finishing a huge 166-page Atlas of the Cave of Dead Bats in early 1997, we soon had a problem: we found new passages connecting between known passages and surveyed them.
ru_ru: После окончания огромного\break 166-страничного Атласа пещер мертвых летучих мышей в начале 1997 года у нас вскоре возникла проблема: мы нашли новые ходы, соединения между известными ходами.

source: After modifying the files in the |mpost| and |tex| directories it's necessary to run Perl scripts |genmpost.pl| and |gentex.pl|, which generate C++ header files, and compile Therion executable again.
ru_ru: После изменения файлов в каталогах |mpost| и |tex| необходимо запустить\break Perl-скрипты |genmpost.pl| и |gentex.pl|, которые генерируют header файлы C++, и снова компилируют исполняемый файл Therion'а.

source: After pressing this button a new scrap will be inserted in the beginning of the file.
ru_ru: После нажатия этой кнопки в начало файла будет вставлен новый скрап.

source: After processing in TJIKPR, the new loops influenced the position of the old surveys; most survey stations now had a slightly different position from before due to the changed error distribution.
ru_ru: После обработки данных в TJIKPR, новые кольца\break повлияли на положение старых станций, большинство станций уже имели иную позицию из-за разброса невязки колец.

source: After selecting a scrap (click on its header in the { File commands} menu) two small red squares connected by red arrow will appear (by default, they'll be in the lower corners of drawing area).
ru_ru: После выбора скрапа (щелкните по его заголовку в меню { Команды в файле}) появятся два небольших красных квадрата, соединенных красной стрелкой (по умолчанию они будут в нижних углах области рисования).

source: After selecting the { m12} in configuration file you receive:
ru_ru: После выбора { m12} в файле конфигурации вы получите:

source: After these preparation steps, you're ready for drawing, or, more precisely, for { creating a map data file}.
ru_ru: После этих этапов подготовки вы готовы к рисованию или, точнее, для { создания файла данных карты}.

source: After this additional |import| final looks as expected.
ru_ru: После этого дополнительного |import| окончательный вариант выглядит так, как ожидалось.

source: Again, for better illustration, a real example follows:
ru_ru: Опять же, для лучшей иллюстрации приведем пример:

source: All altitudes are exported as a difference against grid $Z$ origin (which is 0 by default).
ru_ru: Все высоты экспортируются как разница от $Z$ сетки (по умолчанию 0).

source: All opened images are placed in the upper-left corner of the working area.
ru_ru: Все добавленные изображения помещаются в верхний левый угол рабочей области.

source: All other symbols are not clipped by the scrap boundary.
ru_ru: Все остальные символы не\break подрезаются границей скрапа.

source: All point symbols are drawn in local coordinates with the length unit { u}.
ru_ru: Все точечные символы рисуются в локальных координатах с единицей длины { u}.

source: All previously specified standard deviations or grades are lost.
ru_ru: Все ранее заданные\break стандартные отклонения или определения теряются.

source: All programs (with the exception of BWidget and tkImg package) are usually included in Linux, Unix or MacOS X distributions.
ru_ru: Все программы (за исключением пакетов BWidget и tkImg) обычно\break включаются в дистрибутивы Linux, Unix или MacOS X.

source: All shots having one of the stations named either `|.|' or `|-|' are |splay| shots by default (see also |data| command).
ru_ru: Все замеры, имеющие в названии одной из станций `|.|' или `|-|' по умолчанию имеют тип |splay| (смотрите также команду |data|).

source: Allows to execute system commands during therion compilation.E.g. to open or refresh external PDF viewer.] Normally Therion waits until the subprocess is finished.
ru_ru: Позволяет выполнять системные команды во время компиляцииНапример, чтобы открыть или обновить внешний просмотрщик PDF.]. Обычно Therion ожидает завершения подпроцесса.

source: Almost every coordinate system used worldwide has its own EPSG number.
ru_ru: Почти каждая\break система координат, используемая во всем мире, имеет собственный\break номер EPSG.

source: Also ``|not|'' is allowed before a flag.
ru_ru: Также перед флагом допускается приставка ``|not|''.

source: Also in this case, station references in corresponding .th2 file are same as station names on the next map.
ru_ru: Также в этом случае ссылки станций в соответствующем файле .th2\break совпадают с именами станций на следующей карте.

source: Also |not| is allowed before a flag, to remove previously added flag.
ru_ru: Также приставка |not| может быть использована перед флагом, чтобы удалить ранее добавленный флаг.

source: Although Therion is already used for map production, there are a lot of new features to be implemented:
ru_ru: Хотя Therion уже используется для создания карт, есть много новых\break функций, которые необходимо реализовать:

source: Although Therion makes no distinction between them yet, it should be used to improve 3D modeling in the future.
ru_ru: Хотя Therion еще не делает различий между ними, его следует использовать для улучшения 3D-моделирования в будущем.

source: Although UTF-8 Unicode encoding covers all characters which Therion is able to process, it may be inconvenient to use it.
ru_ru: Хотя кодировка Unicode UTF-8 содержит все символы, которые Therion\break может использовать, возможно вам будет неудобно использовать ее.

source: Although everything (well, almost everything) about Therion input files has been explained, this chapter offers some additional tips and hints.
ru_ru: Несмотря на то, что все (ну, почти все) о входных файлах Therion'а было сказано, в этой главе приведены некоторые дополнительные советы и\break подсказки.

source: Although the data format may look confusing for the first time, it will be explained in the following chapters.
ru_ru: Наличие различных форматов данных может выглядеть запутанным по началу, но все они будут разъяснены в следующих главах.

source: An alternate way is to insert them as a |text| CAUTION!
ru_ru: Альтернативный способ вставить их как |text| ВНИМАНИЕ!

source: An example definition may be
ru_ru: Пример может быть следующим:

source: An example may be
ru_ru: Примером может служить

source: And the morphed walls:
ru_ru: И морфинг стен:

source: Angle units supported: degree[s], minute[s] (also deg, min), grad[s], mil[s], percent[age] (clino only).
ru_ru: Поддерживаемые угловые единицы: degree[s] (градусы), minute[s] (минуты) (можно сокращать deg, min), grad[s] (грады), mil[s] (тысячные), percent[age] (проценты, только для угла\break наклона).

source: Another survey sketch:
ru_ru: Другой эскиз съемки:

source: Any errors are detected only when you process these files with Therion.
ru_ru: Любые ошибки обнаруживаются только при обработке этих файлов с помощью Therion'а.

source: Any subtype specification can be used with user defined type (|u|).
ru_ru: Любой подтип может использоваться с пользовательским типом (|u|).

source: Any volunteers?
ru_ru: Есть желающие?

source: Appendix.
ru_ru: Приложение.

source: Apr 1: the first hyperlinked PDF cave map / atlas
ru_ru: Апрель, 1: первая гиперссылка PDF-карты/атласа.

source: Apr: Therion included in Debian GNU/Linux
ru_ru: Апрель: Therion включен в Debian GNU/Linux.

source: Area is specified by surrounding border lines.
ru_ru: Area (область) определяется окружающими граничными линиями.

source: Area symbols.
ru_ru: Символы областей.

source: Areas are similar to lines: they take only one argument -- { path} in absolute coordinates.
ru_ru: Области похожи на линии: они принимают только один аргумент -- { путь} в абсолютных координатах.

source: Arrows show data flow between programs.
ru_ru: Стрелки показывают поток данных между программами.

source: As the test takes some time (pdfTeX instance is run), you might disable the default behaviour completely by setting |tex-fonts| in the INI file.
ru_ru: Поскольку тест занимает некоторое время (экземпляр pdfTeX запущен), вы можете полностью отключить поведение по умолчанию, установив\break |tex-fonts| в файле INI.

source: As we have mentioned before, there is a small chimney above station 5.
ru_ru: Как мы уже упоминали ранее, на станции 5 имеется небольшая труба.

source: As with scrap insertion, go to the { File commands} menu, click on the { Action} submenu and select { Insert point}; than press newly renamed { Insert point} button.
ru_ru: Как и в случае\break вставки скрапа, перейдите в меню { Команды в файле}, нажмите подменю { Действие} и выберите { Вставить точку}; затем нажать кнопку с\break изменившимся названием на { Вставить точку}.

source: As you can see, even there are two stations with same name, they are distinguished by |-from| option, which specifies previous station in extended elevation.
ru_ru: Как вы видите, даже если есть две станции с одинаковым именем, они отличаются друг от друга опцией |-from|, которая указывает\break предыдущую станцию в разрез-развертке.

source: Assume a situation when you want to join these three small maps within single large project.
ru_ru: Предположим ситуацию, когда вы хотите присоединиться к этим трем\break небольшим картам в рамках одного крупного проекта.

source: Assume following situation (in plan view), when there is a loop in centerline between stations 1 and 4, small chimney near station 5 and entrance to the cave is at station 6.
ru_ru: Предположим следующую ситуацию (в плане) -- есть кольцо нитки хода между станциями 1 и 4, небольшая труба возле станции 5 и вход в пещеру находится на станции 6.

source: Assume that coordinates of cave entrances are specified in the top-level cave.3d file.
ru_ru: Допустим, что\break координаты входных пещер указаны в файле верхнего уровня cave.3d.

source: Assume that there are two maps { m1} and { m2} ({ m1} is above { m2}).
ru_ru: Предположим, существует две карты { m1} и { m2} ({ m1} выше { m2}).

source: Assume you want to create "bat" point, line and area.
ru_ru: Предположим, вы хотите создать точку, линию и область "bat".

source: At the end of each page macro || is invoked.
ru_ru: В конце каждой страницы вызывается макрос ||.

source: Aug: XTherion extended to 2D map editor (as a replacement of ThEdit)
ru_ru: Август: XTherion расширен до редактора 2D-карт (в качестве замены\break ThEdit).

source: Aug: experiments with PDF, pdfand
ru_ru: Август: эксперименты с PDF, pdfи

source: Authors' laziness is not the correct answer.)
ru_ru: Лень авторов -- не правильный ответ.)

source: Auto is default.
ru_ru: По умолчанию `auto'.

source: Available languages are listed on the copyright page.
ru_ru: Доступные языки\break перечислены на странице авторских прав.

source: Average error is simple arithmetic average of all loop errors.
ru_ru: Средняя ошибка -- это простое арифметическое среднее всех ошибок кольца.

source: B pit
ru_ru: B понор

source: Basics.
ru_ru: Основы.

source: Be aware, that symbol set name is case sensitive.
ru_ru: Помните, что имя набора символов чувствительно к регистру.

source: Be sure to uncheck { Fit page to paper} or similar option if you want to print in the exact scale.
ru_ru: Обязательно снимите флаг { Fit page to paper (подогнать под размер страницы)} или аналогичный вариант, если вы хотите напечатать в реальном масштабе.

source: Beginning and orientation of the line is marked by a small orange tick to the left at the first point.
ru_ru: Начало и ориентация линии отмечены небольшой оранжевой галочкой в первой точке.

source: Besides data files, which contain survey data, Therion uses a configuration file, which contains instructions on how the data should be presented.
ru_ru: Помимо файлов данных, содержащих данные съемки, Therion использует файл конфигурации, содержащий инструкции о том, как данные должны обрабатываться.

source: Besides the messages from Therion and other programs used, the log file contains information about computed values of magnetic declination and meridian convergence, loop errors and scrap distortions.
ru_ru: Помимо сообщений от Therion'а и других используемых программ, файл журнала содержит информацию о вычисленных значениях магнитного\break склонения и конвергенции меридиана, ошибок колец и искажений скрапов.

source: Bolek, P.: ``and patterns,'' { TUGboat}, 3, XIX (1998), pp. 276--283, available online at {https://www.tug.org/TUGboat/Articles/tb19-3/tb60bolek.pdf}
ru_ru: Bolek, P.: ``and patterns,'' { TUGboat}, 3, XIX (1998), pp. 276--283, доступна тут: {https://www.tug.org/TUGboat/Articles/tb19-3/tb60bolek.pdf}

source: Both are experimental and subject to change.
ru_ru: Оба экспериментальные и могут быть изменены.

source: Both || and || also contain hyperlinks.
ru_ru: Оба бокса, || и ||, также содержат гиперссылки.

source: Browse the top menu for a minute to get feeling of XTherion.
ru_ru: Просмотрите верхнее меню, чтобы почувствовать XTherion.

source: But don't expect too much.
ru_ru: Но не ожидайте слишком многого.

source: But there are no options which would specify the position of map, navigator and other elements inside the area defined by |page-width| and |page-height| dimensions; e.g., why is the navigator below the map and not on its right or left side?
ru_ru: Но нет никаких опций, которые указывали бы положение карты, навигатора и других элементов внутри области, определяемой |page-width| и |page-height|; например, почему навигатор находится ниже карты, а не справа или слева?

source: By Xmas 1999 we had a minimalistic version of Therion working for the first time.
ru_ru: В рождество 1999 года мы уже имели первую версию Therion'а.

source: By default 0 is used, if `|-|' or `|.|' is specified, no chapter is exported for this map.
ru_ru: По умолчанию используется 0; если используется `|-|' или `|.|', то для этой карты не экспортируется ни одна глава.

source: By default 0 is used; if `basic' is specified, expansion is done up to the basic maps.
ru_ru: По умолчанию используется 0; если указано `basic', расширение выполняется до основных карт (т.е. все).

source: By default Therion searches for file named |thconfig| in the current working directory.
ru_ru: По умолчанию Therion ищет файл с именем |thconfig| в текущем рабочем каталоге.

source: By default therion displays { m1} overlying { m2}.
ru_ru: По умолчанию Therion отображает { m1} поверх { m2}.

source: By default, all survey objects are selected.
ru_ru: По умолчанию\break выбираются все объекты съемки.

source: By default, centerline extended elevation of this situation looks like this:
ru_ru: По умолчанию разрез-развертка этой ситуации выглядит следующим\break образом:

source: By default, not supported on output.
ru_ru: По умолчанию не поддерживается на выходе.

source: By default, survex is used if present, otherwise therion.
ru_ru: По умолчанию используется |survex|, если он установлен, иначе\break используется |therion|;

source: By default, true (astronomical) north is used.
ru_ru: По\break умолчанию используется истинный (астрономический) север.

source: By redefining this macro you'll get desired page layout.
ru_ru: Переопределив этот макрос, вы получите желаемый макет страницы.

source: Case studies.
ru_ru: Изучение примеров.

source: Centreline may be exported for further processing in any SQL database.
ru_ru: Нитка хода может быть экспортирована для дальнейшей обработки в любую базу данных SQL.

source: Changing layout of PDF maps.
ru_ru: Изменение макета PDF-карт.

source: Click on the { Insert} button in { Background images} menu.
ru_ru: Нажмите кнопку { Вставка} в меню\break { Фоновые изображения}.

source: Click on { Insert area} and then click on the lines surrounding the desired area.
ru_ru: Нажмите { Вставить\break область}, а затем щелкните строки окружающие нужную область.

source: Code contributions by { Olly Betts}, { Marco Corvi}, { Vladimir Georgiev}, { Georg Pacher} and { Dimitrios Zachariadis}.
ru_ru: В разработке кода принимали участие { Olly Betts}, { Marco Corvi}, { Vladimir\break Georgiev}, { Georg Pacher} и { Dimitrios Zachariadis}.

source: Colour range is 0--100 for grayscale, [0--100 0--100 0--100] triplet for RGB colours.
ru_ru: Цветовой диапазон 0-100 для оттенков серого, [0-100 0-100 0-100] для цветов в\break пространстве RGB.

source: Compilation.
ru_ru: Компиляция.

source: Compiler window is the default window of XTherion.
ru_ru: Окно компилятора -- это окно по умолчанию в\break XTherion'е.

source: Configuration file.
ru_ru: Конфигурационный файл.

source: Consult the documentation of your OS how to set them.
ru_ru: Проконсультируйтесь с документацией вашей ОС о том, как их установить.

source: Context { all} means that the command may be used anywhere.
ru_ru: Контекст { all} означает, что команда может использоваться в любом месте.

source: Coordinate systems.
ru_ru: Системы координат.

source: Copy a translation file to the |thchencdata| directory; add its name to `ifiles' hash in the beginning of the Perl script |generate.pl|; run it and recompile Therion.
ru_ru: Скопируйте файл перевода в |thchencdata| каталог; добавьте его имя в хэш-код `ifiles' в начале скрипта Perl |generate.pl|; запустите его и перекомпилируйте Therion.

source: Corresponding configuration file could be:
ru_ru: Соответствующий конфигурационный файл может быть:

source: Created PDF files may be optionally post-processed in applications like pdfor Adobe Acrobat---it's possible to extract or change some pages, add comments or encryption, etc.
ru_ru: Созданные PDF-файлы могут быть необязательно пост-обработаны в таких приложениях, как pdfили Adobe Acrobat -- можно извлечь или изменить некоторые страницы, добавить комментарии или шифрование и т.д.

source: Creating data files.
ru_ru: Создание файлов данных.

source: Cross-sections are named |foo_ci|, lines |foo_li| etc.
ru_ru: Поперечные сечения именуются |foo_ci|, линии |foo_li| и т.п.

source: Currently it works in three main modes: text editor, map editor and compiler.
ru_ru: В настоящее время он\break работает в трех основных режимах: текстовый редактор, редактор карт и компилятор

source: Currently only JPEG maps are supported in 3D.]) or surface grid -- digital elevation model (in 3D model only).
ru_ru: В настоящее время поддерживаются только карты JPEG в 3D.]) или поверхностная сетка -- цифровая модель рельефа (только в 3D-модели).

source: Currently the following output formats are supported: |html| (default), |txt|, {5.4}|kml|For cave-list and continuation-list.] and |dbf|.
ru_ru: В настоящее время поддерживаются\break следующие форматы вывода: |html| (по умолчанию), |txt|, {5.4}|kml|Для списка пещер и списка продолжений (перспектив).] и |dbf|.

source: Currently the following output formats are supported: |loch| (native format; default), |compass| (plt file), |survex| (3d file), |dxf|, |esri| (3d shapefiles), |vrml|, |3dmf| and |kml| (Google Earth).
ru_ru: В настоящее время поддерживаются следующие форматы вывода: |loch| (собственный формат, по умолчанию), |compass| (plt файл), |survex| (3d файл), |dxf|, |esri| (3d shapefiles), |vrml|, |3dmf| и |kml| (Google Earth).

source: Currently |pdf|, |svg|, |xhtml|SVG embedded in XHTML file which contains also legend], |survex|, |dxf|, |esri|ESRI shapefiles.
ru_ru: В данный момент\break поддерживаются форматы |pdf|, |svg|, |xhtml|SVG, встроенный в XHTML-файл, который также содержит легенду.], |survex|, |dxf|, |esri|ESRI shapefiles.

source: Custom attributes.
ru_ru: Пользовательские атрибуты.

source: Customizing text labels.
ru_ru: Настройка текстовых меток.

source: DON'T PANIC!
ru_ru: НЕ ПАНИКУЙТЕ!

source: Data format.
ru_ru: Формат данных.

source: Data types.
ru_ru: Типы данных.

source: Dec 27: Therion compiles simple map in PostScript format for the first time (32 kB of Perl and 7 kB of and source code).
ru_ru: Декабрь, 27: Therion впервые компилирует простую карту в формате PostScript (32 Кбайт Perl и 7 Кбайт и исходного кода).

source: Dec 30: the first web page (with data examples but without source code)
ru_ru: Декабрь, 30: первая веб-страница (с примерами данных, но без исходного кода).

source: Dec: ThEdit exports simple map for the first time
ru_ru: Декабрь: ThEdit впервые экспортирует простую карту.

source: Default extension is `.th' and may be omitted.
ru_ru: Расширение по умолчанию `.th' и его можно не указывать.

source: Default output language.
ru_ru: Язык вывода по умолчанию.

source: Default setting is |tex-fonts raw cmr10 cmti10 cmbx10 cmss10 cmssi10|
ru_ru: Значение по умолчанию: |tex-fonts raw cmr10 cmti10 cmbx10 cmss10 cmssi10|.

source: Default settings should work fine for users using just latin charactersIn the PDF map Therion renders most of the accented characters as a combination of accent and a base character.
ru_ru: Настройки по\break умолчанию должны работать отлично для пользователей использующих\break только латинские символы На PDF-картах Therion отображает большинство акцентированных символов как\break сочетание акцента и базового символа.

source: Default value is `|out|' for walls, `|none|' for all other lines.
ru_ru: Значение по умолчанию -- `|out|' для стен, `|none|' для всех других линий.

source: Define a new coordinate system |<id>| using Proj4 syntax.
ru_ru: Определяет новую систему координат |<id>| используя синтаксис Proj4;

source: Detailed information about each sub-survey gives |export survey-list| command.
ru_ru: Подробная информация о каждой съемке дает команда |export survey-list|.

source: Determines the level at which chapter expansion for atlas export is stopped.
ru_ru: Определяет уровень, при котором прекращается расширение главы для экспорта в виде атласа.

source: Determines the level at which map expansion for atlas export is stopped.
ru_ru: Определяет уровень, на котором прекращается расширение карты для экспорта в виде атласа.

source: Displayed blue in the |debug| mode.
ru_ru: Отображается синим цветом в режиме |debug|.
